zephyrproject-rtos/hal_nxp/dts/nxp/mcx/MCXA166VLQ-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MCXA166VLQ/signal_configuration.xml
 *
 * 
 */

#ifndef _ZEPHYR_DTS_BINDING_MCXA166VLQ_
#define _ZEPHYR_DTS_BINDING_MCXA166VLQ_

#define A15X_MUX(port, pin, mux)		\
	(((((port) - '0') & 0xF) << 28) |	\
	(((pin) & 0x3F) << 22) |		\
	(((mux) & 0xF) << 8))

#define P0_0 A15X_MUX('0',0,0) /* PT0_0 */
#define TMS_P0_0 A15X_MUX('0',0,1) /* PT0_0 */
#define SWDIO_P0_0 A15X_MUX('0',0,1) /* PT0_0 */
#define LPUART0_RTS_B_P0_0 A15X_MUX('0',0,2) /* PT0_0 */
#define LPSPI0_PCS0_P0_0 A15X_MUX('0',0,3) /* PT0_0 */
#define CT_INP0_P0_0 A15X_MUX('0',0,4) /* PT0_0 */
#define P0_1 A15X_MUX('0',1,0) /* PT0_1 */
#define SWCLK_P0_1 A15X_MUX('0',1,1) /* PT0_1 */
#define TCLK_P0_1 A15X_MUX('0',1,1) /* PT0_1 */
#define LPUART0_CTS_B_P0_1 A15X_MUX('0',1,2) /* PT0_1 */
#define LPSPI0_SDI_P0_1 A15X_MUX('0',1,3) /* PT0_1 */
#define CT_INP1_P0_1 A15X_MUX('0',1,4) /* PT0_1 */
#define ADC2_A8_P0_2 A15X_MUX('0',2,0) /* PT0_2 */
#define P0_2 A15X_MUX('0',2,0) /* PT0_2 */
#define SWO_P0_2 A15X_MUX('0',2,1) /* PT0_2 */
#define TDO_P0_2 A15X_MUX('0',2,1) /* PT0_2 */
#define LPUART0_RXD_P0_2 A15X_MUX('0',2,2) /* PT0_2 */
#define LPSPI0_SCK_P0_2 A15X_MUX('0',2,3) /* PT0_2 */
#define CT0_MAT0_P0_2 A15X_MUX('0',2,4) /* PT0_2 */
#define UTICK_CAP0_P0_2 A15X_MUX('0',2,5) /* PT0_2 */
#define CMP1_IN1_P0_3 A15X_MUX('0',3,0) /* PT0_3 */
#define P0_3 A15X_MUX('0',3,0) /* PT0_3 */
#define ADC0_A14_P0_3 A15X_MUX('0',3,0) /* PT0_3 */
#define TDI_P0_3 A15X_MUX('0',3,1) /* PT0_3 */
#define LPUART0_TXD_P0_3 A15X_MUX('0',3,2) /* PT0_3 */
#define LPSPI0_SDO_P0_3 A15X_MUX('0',3,3) /* PT0_3 */
#define CT0_MAT1_P0_3 A15X_MUX('0',3,4) /* PT0_3 */
#define UTICK_CAP1_P0_3 A15X_MUX('0',3,5) /* PT0_3 */
#define CMP0_OUT_P0_3 A15X_MUX('0',3,8) /* PT0_3 */
#define ADC2_A9_P0_4 A15X_MUX('0',4,0) /* PT0_4 */
#define WUU0_IN0_P0_4 A15X_MUX('0',4,0) /* PT0_4 */
#define P0_4 A15X_MUX('0',4,0) /* PT0_4 */
#define CT0_MAT2_P0_4 A15X_MUX('0',4,4) /* PT0_4 */
#define UTICK_CAP2_P0_4 A15X_MUX('0',4,5) /* PT0_4 */
#define SmartDMA_PIO0_P0_4 A15X_MUX('0',4,7) /* PT0_4 */
#define CMP1_OUT_P0_4 A15X_MUX('0',4,8) /* PT0_4 */
#define ADC2_A10_P0_5 A15X_MUX('0',5,0) /* PT0_5 */
#define P0_5 A15X_MUX('0',5,0) /* PT0_5 */
#define CT0_MAT3_P0_5 A15X_MUX('0',5,4) /* PT0_5 */
#define UTICK_CAP3_P0_5 A15X_MUX('0',5,5) /* PT0_5 */
#define SmartDMA_PIO1_P0_5 A15X_MUX('0',5,7) /* PT0_5 */
#define CMP2_OUT_P0_5 A15X_MUX('0',5,8) /* PT0_5 */
#define P0_6 A15X_MUX('0',6,0) /* PT0_6 */
#define ADC0_A15_P0_6 A15X_MUX('0',6,0) /* PT0_6 */
#define ISPMODE_N_P0_6 A15X_MUX('0',6,1) /* PT0_6 */
#define LPI2C0_HREQ_P0_6 A15X_MUX('0',6,2) /* PT0_6 */
#define LPSPI0_PCS1_P0_6 A15X_MUX('0',6,3) /* PT0_6 */
#define CT_INP2_P0_6 A15X_MUX('0',6,4) /* PT0_6 */
#define SmartDMA_PIO2_P0_6 A15X_MUX('0',6,7) /* PT0_6 */
#define CMP1_OUT_P0_6 A15X_MUX('0',6,8) /* PT0_6 */
#define CLKOUT_P0_6 A15X_MUX('0',6,12) /* PT0_6 */
#define WUU0_IN1_P0_7 A15X_MUX('0',7,0) /* PT0_7 */
#define P0_7 A15X_MUX('0',7,0) /* PT0_7 */
#define CMP2_IN1_P0_7 A15X_MUX('0',7,0) /* PT0_7 */
#define ADC2_A11_P0_7 A15X_MUX('0',7,0) /* PT0_7 */
#define CT_INP3_P0_7 A15X_MUX('0',7,4) /* PT0_7 */
#define SmartDMA_PIO3_P0_7 A15X_MUX('0',7,7) /* PT0_7 */
#define ADC2_A12_P0_12 A15X_MUX('0',12,0) /* PT0_12 */
#define P0_12 A15X_MUX('0',12,0) /* PT0_12 */
#define CT0_MAT2_P0_12 A15X_MUX('0',12,4) /* PT0_12 */
#define ADC2_A13_P0_13 A15X_MUX('0',13,0) /* PT0_13 */
#define P0_13 A15X_MUX('0',13,0) /* PT0_13 */
#define CT0_MAT3_P0_13 A15X_MUX('0',13,4) /* PT0_13 */
#define P0_14 A15X_MUX('0',14,0) /* PT0_14 */
#define ADC2_A14_P0_14 A15X_MUX('0',14,0) /* PT0_14 */
#define CT_INP2_P0_14 A15X_MUX('0',14,4) /* PT0_14 */
#define UTICK_CAP0_P0_14 A15X_MUX('0',14,5) /* PT0_14 */
#define SmartDMA_PIO4_P0_14 A15X_MUX('0',14,7) /* PT0_14 */
#define P0_15 A15X_MUX('0',15,0) /* PT0_15 */
#define ADC2_A15_P0_15 A15X_MUX('0',15,0) /* PT0_15 */
#define CT_INP3_P0_15 A15X_MUX('0',15,4) /* PT0_15 */
#define UTICK_CAP1_P0_15 A15X_MUX('0',15,5) /* PT0_15 */
#define SmartDMA_PIO5_P0_15 A15X_MUX('0',15,7) /* PT0_15 */
#define P0_16 A15X_MUX('0',16,0) /* PT0_16 */
#define WUU0_IN2_P0_16 A15X_MUX('0',16,0) /* PT0_16 */
#define LPI2C0_SDA_P0_16 A15X_MUX('0',16,2) /* PT0_16 */
#define LPSPI0_PCS2_P0_16 A15X_MUX('0',16,3) /* PT0_16 */
#define CT0_MAT0_P0_16 A15X_MUX('0',16,4) /* PT0_16 */
#define UTICK_CAP2_P0_16 A15X_MUX('0',16,5) /* PT0_16 */
#define SmartDMA_PIO6_P0_16 A15X_MUX('0',16,7) /* PT0_16 */
#define P0_17 A15X_MUX('0',17,0) /* PT0_17 */
#define LPI2C0_SCL_P0_17 A15X_MUX('0',17,2) /* PT0_17 */
#define LPSPI0_PCS3_P0_17 A15X_MUX('0',17,3) /* PT0_17 */
#define CT0_MAT1_P0_17 A15X_MUX('0',17,4) /* PT0_17 */
#define UTICK_CAP3_P0_17 A15X_MUX('0',17,5) /* PT0_17 */
#define SmartDMA_PIO7_P0_17 A15X_MUX('0',17,7) /* PT0_17 */
#define ADC0_A8_P0_18 A15X_MUX('0',18,0) /* PT0_18 */
#define P0_18 A15X_MUX('0',18,0) /* PT0_18 */
#define LPI2C0_SCLS_P0_18 A15X_MUX('0',18,2) /* PT0_18 */
#define CT0_MAT2_P0_18 A15X_MUX('0',18,4) /* PT0_18 */
#define SmartDMA_PIO8_P0_18 A15X_MUX('0',18,7) /* PT0_18 */
#define CMP0_OUT_P0_18 A15X_MUX('0',18,8) /* PT0_18 */
#define ADC0_A9_P0_19 A15X_MUX('0',19,0) /* PT0_19 */
#define WUU0_IN3_P0_19 A15X_MUX('0',19,0) /* PT0_19 */
#define P0_19 A15X_MUX('0',19,0) /* PT0_19 */
#define LPI2C0_SDAS_P0_19 A15X_MUX('0',19,2) /* PT0_19 */
#define CT0_MAT3_P0_19 A15X_MUX('0',19,4) /* PT0_19 */
#define SmartDMA_PIO9_P0_19 A15X_MUX('0',19,7) /* PT0_19 */
#define CMP1_OUT_P0_19 A15X_MUX('0',19,8) /* PT0_19 */
#define WUU0_IN4_P0_20 A15X_MUX('0',20,0) /* PT0_20 */
#define P0_20 A15X_MUX('0',20,0) /* PT0_20 */
#define ADC0_A10_P0_20 A15X_MUX('0',20,0) /* PT0_20 */
#define LPUART0_RXD_P0_20 A15X_MUX('0',20,3) /* PT0_20 */
#define CT_INP0_P0_20 A15X_MUX('0',20,4) /* PT0_20 */
#define SmartDMA_PIO10_P0_20 A15X_MUX('0',20,7) /* PT0_20 */
#define CMP2_OUT_P0_20 A15X_MUX('0',20,8) /* PT0_20 */
#define ADC0_A11_P0_21 A15X_MUX('0',21,0) /* PT0_21 */
#define P0_21 A15X_MUX('0',21,0) /* PT0_21 */
#define LPUART0_TXD_P0_21 A15X_MUX('0',21,3) /* PT0_21 */
#define CT_INP1_P0_21 A15X_MUX('0',21,4) /* PT0_21 */
#define SmartDMA_PIO11_P0_21 A15X_MUX('0',21,7) /* PT0_21 */
#define ADC0_A12_P0_22 A15X_MUX('0',22,0) /* PT0_22 */
#define P0_22 A15X_MUX('0',22,0) /* PT0_22 */
#define LPUART0_RTS_B_P0_22 A15X_MUX('0',22,3) /* PT0_22 */
#define CT_INP2_P0_22 A15X_MUX('0',22,4) /* PT0_22 */
#define CT0_MAT0_P0_22 A15X_MUX('0',22,5) /* PT0_22 */
#define SmartDMA_PIO12_P0_22 A15X_MUX('0',22,7) /* PT0_22 */
#define CMP2_IN2_P0_23 A15X_MUX('0',23,0) /* PT0_23 */
#define ADC0_A13_P0_23 A15X_MUX('0',23,0) /* PT0_23 */
#define WUU0_IN5_P0_23 A15X_MUX('0',23,0) /* PT0_23 */
#define P0_23 A15X_MUX('0',23,0) /* PT0_23 */
#define LPUART0_CTS_B_P0_23 A15X_MUX('0',23,3) /* PT0_23 */
#define CT_INP3_P0_23 A15X_MUX('0',23,4) /* PT0_23 */
#define CT0_MAT1_P0_23 A15X_MUX('0',23,5) /* PT0_23 */
#define SmartDMA_PIO13_P0_23 A15X_MUX('0',23,7) /* PT0_23 */
#define P0_24 A15X_MUX('0',24,0) /* PT0_24 */
#define CT0_MAT0_P0_24 A15X_MUX('0',24,4) /* PT0_24 */
#define LPUART5_RXD_P0_24 A15X_MUX('0',24,8) /* PT0_24 */
#define P0_25 A15X_MUX('0',25,0) /* PT0_25 */
#define CT0_MAT1_P0_25 A15X_MUX('0',25,4) /* PT0_25 */
#define LPUART5_TXD_P0_25 A15X_MUX('0',25,8) /* PT0_25 */
#define P0_26 A15X_MUX('0',26,0) /* PT0_26 */
#define CT0_MAT2_P0_26 A15X_MUX('0',26,4) /* PT0_26 */
#define LPUART5_RTS_B_P0_26 A15X_MUX('0',26,8) /* PT0_26 */
#define P0_27 A15X_MUX('0',27,0) /* PT0_27 */
#define CT0_MAT3_P0_27 A15X_MUX('0',27,4) /* PT0_27 */
#define LPUART5_CTS_B_P0_27 A15X_MUX('0',27,8) /* PT0_27 */
#define LPTMR0_ALT3_P1_0 A15X_MUX('1',0,0) /* PT1_0 */
#define WUU0_IN6_P1_0 A15X_MUX('1',0,0) /* PT1_0 */
#define ADC0_A16_P1_0 A15X_MUX('1',0,0) /* PT1_0 */
#define CMP0_IN3_P1_0 A15X_MUX('1',0,0) /* PT1_0 */
#define P1_0 A15X_MUX('1',0,0) /* PT1_0 */
#define TRIG_IN0_P1_0 A15X_MUX('1',0,1) /* PT1_0 */
#define LPSPI0_SDO_P1_0 A15X_MUX('1',0,2) /* PT1_0 */
#define LPI2C1_SDA_P1_0 A15X_MUX('1',0,3) /* PT1_0 */
#define TRIG_IN0/CT_INP4_P1_0_P1_0 A15X_MUX('1',0,4) /* PT1_0 */
#define CT_INP4_P1_0 A15X_MUX('1',0,4) /* PT1_0 */
#define CT0_MAT2_P1_0 A15X_MUX('1',0,5) /* PT1_0 */
#define P1_1 A15X_MUX('1',1,0) /* PT1_1 */
#define CMP1_IN3_P1_1 A15X_MUX('1',1,0) /* PT1_1 */
#define ADC0_A17_P1_1 A15X_MUX('1',1,0) /* PT1_1 */
#define TRIG_IN1_P1_1 A15X_MUX('1',1,1) /* PT1_1 */
#define LPSPI0_SCK_P1_1 A15X_MUX('1',1,2) /* PT1_1 */
#define LPI2C1_SCL_P1_1 A15X_MUX('1',1,3) /* PT1_1 */
#define CT_INP5_P1_1 A15X_MUX('1',1,4) /* PT1_1 */
#define TRIG_IN1/CT_INP5_P1_1_P1_1 A15X_MUX('1',1,4) /* PT1_1 */
#define CT0_MAT3_P1_1 A15X_MUX('1',1,5) /* PT1_1 */
#define ADC0_A18_P1_2 A15X_MUX('1',2,0) /* PT1_2 */
#define CMP2_IN3_P1_2 A15X_MUX('1',2,0) /* PT1_2 */
#define P1_2 A15X_MUX('1',2,0) /* PT1_2 */
#define TRIG_OUT0_P1_2 A15X_MUX('1',2,1) /* PT1_2 */
#define LPSPI0_SDI_P1_2 A15X_MUX('1',2,2) /* PT1_2 */
#define LPI2C1_SDAS_P1_2 A15X_MUX('1',2,3) /* PT1_2 */
#define CT1_MAT0_P1_2 A15X_MUX('1',2,4) /* PT1_2 */
#define CT_INP0_P1_2 A15X_MUX('1',2,5) /* PT1_2 */
#define CAN0_TXD_P1_2 A15X_MUX('1',2,11) /* PT1_2 */
#define P1_3 A15X_MUX('1',3,0) /* PT1_3 */
#define CMP0_IN1_P1_3 A15X_MUX('1',3,0) /* PT1_3 */
#define ADC0_A19_P1_3 A15X_MUX('1',3,0) /* PT1_3 */
#define WUU0_IN7_P1_3 A15X_MUX('1',3,0) /* PT1_3 */
#define TRIG_OUT1_P1_3 A15X_MUX('1',3,1) /* PT1_3 */
#define LPSPI0_PCS0_P1_3 A15X_MUX('1',3,2) /* PT1_3 */
#define LPI2C1_SCLS_P1_3 A15X_MUX('1',3,3) /* PT1_3 */
#define CT1_MAT1_P1_3 A15X_MUX('1',3,4) /* PT1_3 */
#define CT_INP1_P1_3 A15X_MUX('1',3,5) /* PT1_3 */
#define CAN0_RXD_P1_3 A15X_MUX('1',3,11) /* PT1_3 */
#define WUU0_IN8_P1_4 A15X_MUX('1',4,0) /* PT1_4 */
#define ADC0_A20_P1_4 A15X_MUX('1',4,0) /* PT1_4 */
#define P1_4 A15X_MUX('1',4,0) /* PT1_4 */
#define CMP0_IN2_P1_4 A15X_MUX('1',4,0) /* PT1_4 */
#define FREQME_CLK_IN0_P1_4 A15X_MUX('1',4,1) /* PT1_4 */
#define LPSPI0_PCS3_P1_4 A15X_MUX('1',4,2) /* PT1_4 */
#define LPUART2_RXD_P1_4 A15X_MUX('1',4,3) /* PT1_4 */
#define CT1_MAT2_P1_4 A15X_MUX('1',4,4) /* PT1_4 */
#define SmartDMA_PIO0_P1_4 A15X_MUX('1',4,7) /* PT1_4 */
#define CMP1_IN2_P1_5 A15X_MUX('1',5,0) /* PT1_5 */
#define ADC0_A21_P1_5 A15X_MUX('1',5,0) /* PT1_5 */
#define P1_5 A15X_MUX('1',5,0) /* PT1_5 */
#define FREQME_CLK_IN1_P1_5 A15X_MUX('1',5,1) /* PT1_5 */
#define LPSPI0_PCS2_P1_5 A15X_MUX('1',5,2) /* PT1_5 */
#define LPUART2_TXD_P1_5 A15X_MUX('1',5,3) /* PT1_5 */
#define CT1_MAT3_P1_5 A15X_MUX('1',5,4) /* PT1_5 */
#define SmartDMA_PIO1_P1_5 A15X_MUX('1',5,7) /* PT1_5 */
#define ADC0_A22_P1_6 A15X_MUX('1',6,0) /* PT1_6 */
#define P1_6 A15X_MUX('1',6,0) /* PT1_6 */
#define TRIG_IN2_P1_6 A15X_MUX('1',6,1) /* PT1_6 */
#define LPSPI0_PCS1_P1_6 A15X_MUX('1',6,2) /* PT1_6 */
#define LPUART2_RTS_B_P1_6 A15X_MUX('1',6,3) /* PT1_6 */
#define CT_INP6_P1_6 A15X_MUX('1',6,4) /* PT1_6 */
#define TRIG_IN2/CT_INP6_P1_6_P1_6 A15X_MUX('1',6,4) /* PT1_6 */
#define CT4_MAT0_P1_6 A15X_MUX('1',6,5) /* PT1_6 */
#define SmartDMA_PIO2_P1_6 A15X_MUX('1',6,7) /* PT1_6 */
#define P1_7 A15X_MUX('1',7,0) /* PT1_7 */
#define ADC0_A23_P1_7 A15X_MUX('1',7,0) /* PT1_7 */
#define WUU0_IN9_P1_7 A15X_MUX('1',7,0) /* PT1_7 */
#define TRIG_OUT2_P1_7 A15X_MUX('1',7,1) /* PT1_7 */
#define LPUART2_CTS_B_P1_7 A15X_MUX('1',7,3) /* PT1_7 */
#define CT_INP7_P1_7 A15X_MUX('1',7,4) /* PT1_7 */
#define CT4_MAT1_P1_7 A15X_MUX('1',7,5) /* PT1_7 */
#define SmartDMA_PIO3_P1_7 A15X_MUX('1',7,7) /* PT1_7 */
#define WUU0_IN10_P1_8 A15X_MUX('1',8,0) /* PT1_8 */
#define P1_8 A15X_MUX('1',8,0) /* PT1_8 */
#define FREQME_CLK_IN0_P1_8 A15X_MUX('1',8,1) /* PT1_8 */
#define LPUART1_RXD_P1_8 A15X_MUX('1',8,2) /* PT1_8 */
#define LPI2C2_SDA_P1_8 A15X_MUX('1',8,3) /* PT1_8 */
#define CT_INP8_P1_8 A15X_MUX('1',8,4) /* PT1_8 */
#define CT0_MAT2_P1_8 A15X_MUX('1',8,5) /* PT1_8 */
#define SmartDMA_PIO4_P1_8 A15X_MUX('1',8,7) /* PT1_8 */
#define P1_9 A15X_MUX('1',9,0) /* PT1_9 */
#define FREQME_CLK_IN1_P1_9 A15X_MUX('1',9,1) /* PT1_9 */
#define LPUART1_TXD_P1_9 A15X_MUX('1',9,2) /* PT1_9 */
#define LPI2C2_SCL_P1_9 A15X_MUX('1',9,3) /* PT1_9 */
#define CT_INP9_P1_9 A15X_MUX('1',9,4) /* PT1_9 */
#define CT0_MAT3_P1_9 A15X_MUX('1',9,5) /* PT1_9 */
#define SmartDMA_PIO5_P1_9 A15X_MUX('1',9,7) /* PT1_9 */
#define ADC1_A8_P1_10 A15X_MUX('1',10,0) /* PT1_10 */
#define P1_10 A15X_MUX('1',10,0) /* PT1_10 */
#define LPUART1_RTS_B_P1_10 A15X_MUX('1',10,2) /* PT1_10 */
#define LPI2C2_SDAS_P1_10 A15X_MUX('1',10,3) /* PT1_10 */
#define CT2_MAT0_P1_10 A15X_MUX('1',10,4) /* PT1_10 */
#define SmartDMA_PIO6_P1_10 A15X_MUX('1',10,7) /* PT1_10 */
#define LPUART5_TXD_P1_10 A15X_MUX('1',10,8) /* PT1_10 */
#define CAN0_TXD_P1_10 A15X_MUX('1',10,11) /* PT1_10 */
#define WUU0_IN11_P1_11 A15X_MUX('1',11,0) /* PT1_11 */
#define P1_11 A15X_MUX('1',11,0) /* PT1_11 */
#define ADC1_A9_P1_11 A15X_MUX('1',11,0) /* PT1_11 */
#define TRIG_OUT2_P1_11 A15X_MUX('1',11,1) /* PT1_11 */
#define LPUART1_CTS_B_P1_11 A15X_MUX('1',11,2) /* PT1_11 */
#define LPI2C2_SCLS_P1_11 A15X_MUX('1',11,3) /* PT1_11 */
#define CT2_MAT1_P1_11 A15X_MUX('1',11,4) /* PT1_11 */
#define SmartDMA_PIO7_P1_11 A15X_MUX('1',11,7) /* PT1_11 */
#define LPUART5_RXD_P1_11 A15X_MUX('1',11,8) /* PT1_11 */
#define CAN0_RXD_P1_11 A15X_MUX('1',11,11) /* PT1_11 */
#define WUU0_IN12_P1_12 A15X_MUX('1',12,0) /* PT1_12 */
#define ADC1_A10_P1_12 A15X_MUX('1',12,0) /* PT1_12 */
#define P1_12 A15X_MUX('1',12,0) /* PT1_12 */
#define LPI2C1_SDA_P1_12 A15X_MUX('1',12,2) /* PT1_12 */
#define LPUART2_RXD_P1_12 A15X_MUX('1',12,3) /* PT1_12 */
#define CT2_MAT2_P1_12 A15X_MUX('1',12,4) /* PT1_12 */
#define SmartDMA_PIO8_P1_12 A15X_MUX('1',12,7) /* PT1_12 */
#define LPUART5_CTS_B_P1_12 A15X_MUX('1',12,8) /* PT1_12 */
#define P1_13 A15X_MUX('1',13,0) /* PT1_13 */
#define ADC1_A11_P1_13 A15X_MUX('1',13,0) /* PT1_13 */
#define TRIG_IN3_P1_13 A15X_MUX('1',13,1) /* PT1_13 */
#define LPI2C1_SCL_P1_13 A15X_MUX('1',13,2) /* PT1_13 */
#define LPUART2_TXD_P1_13 A15X_MUX('1',13,3) /* PT1_13 */
#define CT2_MAT3_P1_13 A15X_MUX('1',13,4) /* PT1_13 */
#define SmartDMA_PIO9_P1_13 A15X_MUX('1',13,7) /* PT1_13 */
#define LPUART5_RTS_B_P1_13 A15X_MUX('1',13,8) /* PT1_13 */
#define P1_14 A15X_MUX('1',14,0) /* PT1_14 */
#define ADC1_A12_P1_14 A15X_MUX('1',14,0) /* PT1_14 */
#define LPI2C1_SCLS_P1_14 A15X_MUX('1',14,2) /* PT1_14 */
#define LPUART2_RTS_B_P1_14 A15X_MUX('1',14,3) /* PT1_14 */
#define CT3_MAT0_P1_14 A15X_MUX('1',14,5) /* PT1_14 */
#define SmartDMA_PIO10_P1_14 A15X_MUX('1',14,7) /* PT1_14 */
#define WUU0_IN13_P1_15 A15X_MUX('1',15,0) /* PT1_15 */
#define ADC1_A13_P1_15 A15X_MUX('1',15,0) /* PT1_15 */
#define P1_15 A15X_MUX('1',15,0) /* PT1_15 */
#define LPI2C1_SDAS_P1_15 A15X_MUX('1',15,2) /* PT1_15 */
#define LPUART2_CTS_B_P1_15 A15X_MUX('1',15,3) /* PT1_15 */
#define CT3_MAT1_P1_15 A15X_MUX('1',15,5) /* PT1_15 */
#define SmartDMA_PIO11_P1_15 A15X_MUX('1',15,7) /* PT1_15 */
#define ADC1_A14_P1_16 A15X_MUX('1',16,0) /* PT1_16 */
#define P1_16 A15X_MUX('1',16,0) /* PT1_16 */
#define WUU0_IN14_P1_16 A15X_MUX('1',16,0) /* PT1_16 */
#define CT_INP12_P1_16 A15X_MUX('1',16,4) /* PT1_16 */
#define SmartDMA_PIO12_P1_16 A15X_MUX('1',16,7) /* PT1_16 */
#define LPUART5_RXD_P1_16 A15X_MUX('1',16,8) /* PT1_16 */
#define P1_17 A15X_MUX('1',17,0) /* PT1_17 */
#define ADC1_A15_P1_17 A15X_MUX('1',17,0) /* PT1_17 */
#define CT_INP13_P1_17 A15X_MUX('1',17,4) /* PT1_17 */
#define SmartDMA_PIO13_P1_17 A15X_MUX('1',17,7) /* PT1_17 */
#define LPUART5_TXD_P1_17 A15X_MUX('1',17,8) /* PT1_17 */
#define ADC1_A16_P1_18 A15X_MUX('1',18,0) /* PT1_18 */
#define P1_18 A15X_MUX('1',18,0) /* PT1_18 */
#define FREQME_CLK_IN0_P1_18 A15X_MUX('1',18,1) /* PT1_18 */
#define CT3_MAT0_P1_18 A15X_MUX('1',18,4) /* PT1_18 */
#define SmartDMA_PIO14_P1_18 A15X_MUX('1',18,7) /* PT1_18 */
#define LPUART5_RTS_B_P1_18 A15X_MUX('1',18,8) /* PT1_18 */
#define CAN0_TXD_P1_18 A15X_MUX('1',18,11) /* PT1_18 */
#define P1_19 A15X_MUX('1',19,0) /* PT1_19 */
#define ADC1_A17_P1_19 A15X_MUX('1',19,0) /* PT1_19 */
#define WUU0_IN15_P1_19 A15X_MUX('1',19,0) /* PT1_19 */
#define FREQME_CLK_IN1_P1_19 A15X_MUX('1',19,1) /* PT1_19 */
#define CT3_MAT1_P1_19 A15X_MUX('1',19,4) /* PT1_19 */
#define SmartDMA_PIO15_P1_19 A15X_MUX('1',19,7) /* PT1_19 */
#define LPUART5_CTS_B_P1_19 A15X_MUX('1',19,8) /* PT1_19 */
#define CAN0_RXD_P1_19 A15X_MUX('1',19,11) /* PT1_19 */
#define P1_29 A15X_MUX('1',29,0) /* PT1_29 */
#define RESET_B_P1_29 A15X_MUX('1',29,1) /* PT1_29 */
#define SPC_LPREQ_P1_29 A15X_MUX('1',29,2) /* PT1_29 */
#define P1_30 A15X_MUX('1',30,0) /* PT1_30 */
#define XTAL48M_P1_30 A15X_MUX('1',30,0) /* PT1_30 */
#define TRIG_OUT3_P1_30 A15X_MUX('1',30,1) /* PT1_30 */
#define LPI2C0_SDA_P1_30 A15X_MUX('1',30,3) /* PT1_30 */
#define CT_INP16_P1_30 A15X_MUX('1',30,4) /* PT1_30 */
#define EXTAL48M_P1_31 A15X_MUX('1',31,0) /* PT1_31 */
#define P1_31 A15X_MUX('1',31,0) /* PT1_31 */
#define TRIG_IN4_P1_31 A15X_MUX('1',31,1) /* PT1_31 */
#define LPI2C0_SCL_P1_31 A15X_MUX('1',31,3) /* PT1_31 */
#define CT_INP17_P1_31 A15X_MUX('1',31,4) /* PT1_31 */
#define TRIG_IN4/CT_INP17_P1_31_P1_31 A15X_MUX('1',31,4) /* PT1_31 */
#define ADC0_A0_P2_0 A15X_MUX('2',0,0) /* PT2_0 */
#define OPAMP2_INP_P2_0 A15X_MUX('2',0,0) /* PT2_0 */
#define WUU0_IN18_P2_0 A15X_MUX('2',0,0) /* PT2_0 */
#define P2_0 A15X_MUX('2',0,0) /* PT2_0 */
#define TRIG_IN6_P2_0 A15X_MUX('2',0,1) /* PT2_0 */
#define LPUART0_RXD_P2_0 A15X_MUX('2',0,2) /* PT2_0 */
#define LPUART4_CTS_B_P2_0 A15X_MUX('2',0,3) /* PT2_0 */
#define CT_INP16_P2_0 A15X_MUX('2',0,4) /* PT2_0 */
#define TRIG_IN6/CT_INP16_P2_0_P2_0 A15X_MUX('2',0,4) /* PT2_0 */
#define CT2_MAT0_P2_0 A15X_MUX('2',0,5) /* PT2_0 */
#define SmartDMA_PIO24_P2_0 A15X_MUX('2',0,7) /* PT2_0 */
#define ADC1_A0_P2_1 A15X_MUX('2',1,0) /* PT2_1 */
#define P2_1 A15X_MUX('2',1,0) /* PT2_1 */
#define OPAMP2_INN_P2_1 A15X_MUX('2',1,0) /* PT2_1 */
#define TRIG_IN7_P2_1 A15X_MUX('2',1,1) /* PT2_1 */
#define LPUART0_TXD_P2_1 A15X_MUX('2',1,2) /* PT2_1 */
#define LPUART4_RTS_B_P2_1 A15X_MUX('2',1,3) /* PT2_1 */
#define CT_INP17_P2_1 A15X_MUX('2',1,4) /* PT2_1 */
#define TRIG_IN7/CT_INP17_P2_1_P2_1 A15X_MUX('2',1,4) /* PT2_1 */
#define CT2_MAT1_P2_1 A15X_MUX('2',1,5) /* PT2_1 */
#define SmartDMA_PIO25_P2_1 A15X_MUX('2',1,7) /* PT2_1 */
#define CMP0_IN0_P2_2 A15X_MUX('2',2,0) /* PT2_2 */
#define ADC0_A4_P2_2 A15X_MUX('2',2,0) /* PT2_2 */
#define P2_2 A15X_MUX('2',2,0) /* PT2_2 */
#define DAC0_OUT_P2_2 A15X_MUX('2',2,0) /* PT2_2 */
#define TRIG_IN6_P2_2 A15X_MUX('2',2,1) /* PT2_2 */
#define LPUART0_RTS_B_P2_2 A15X_MUX('2',2,2) /* PT2_2 */
#define LPUART2_TXD_P2_2 A15X_MUX('2',2,3) /* PT2_2 */
#define CT_INP12_P2_2 A15X_MUX('2',2,4) /* PT2_2 */
#define TRIG_IN6/CT_INP12_P2_2_P2_2 A15X_MUX('2',2,4) /* PT2_2 */
#define CT2_MAT2_P2_2 A15X_MUX('2',2,5) /* PT2_2 */
#define SmartDMA_PIO26_P2_2 A15X_MUX('2',2,7) /* PT2_2 */
#define ADC0_A3_P2_3 A15X_MUX('2',3,0) /* PT2_3 */
#define CMP1_IN0_P2_3 A15X_MUX('2',3,0) /* PT2_3 */
#define WUU0_IN19_P2_3 A15X_MUX('2',3,0) /* PT2_3 */
#define P2_3 A15X_MUX('2',3,0) /* PT2_3 */
#define ADC1_A4_P2_3 A15X_MUX('2',3,0) /* PT2_3 */
#define TRIG_IN7_P2_3 A15X_MUX('2',3,1) /* PT2_3 */
#define LPUART0_CTS_B_P2_3 A15X_MUX('2',3,2) /* PT2_3 */
#define LPUART2_RXD_P2_3 A15X_MUX('2',3,3) /* PT2_3 */
#define TRIG_IN7/CT_INP13_P2_3_P2_3 A15X_MUX('2',3,4) /* PT2_3 */
#define CT_INP13_P2_3 A15X_MUX('2',3,4) /* PT2_3 */
#define CT2_MAT3_P2_3 A15X_MUX('2',3,5) /* PT2_3 */
#define SmartDMA_PIO27_P2_3 A15X_MUX('2',3,7) /* PT2_3 */
#define P2_4 A15X_MUX('2',4,0) /* PT2_4 */
#define CMP2_IN0_P2_4 A15X_MUX('2',4,0) /* PT2_4 */
#define ADC2_A0_P2_4 A15X_MUX('2',4,0) /* PT2_4 */
#define ADC0_A1_P2_4 A15X_MUX('2',4,0) /* PT2_4 */
#define LPUART2_CTS_B_P2_4 A15X_MUX('2',4,3) /* PT2_4 */
#define CT_INP14_P2_4 A15X_MUX('2',4,4) /* PT2_4 */
#define CT1_MAT0_P2_4 A15X_MUX('2',4,5) /* PT2_4 */
#define SmartDMA_PIO28_P2_4 A15X_MUX('2',4,7) /* PT2_4 */
#define ADC3_A0_P2_5 A15X_MUX('2',5,0) /* PT2_5 */
#define P2_5 A15X_MUX('2',5,0) /* PT2_5 */
#define ADC1_A1_P2_5 A15X_MUX('2',5,0) /* PT2_5 */
#define LPUART2_RTS_B_P2_5 A15X_MUX('2',5,3) /* PT2_5 */
#define CT_INP15_P2_5 A15X_MUX('2',5,4) /* PT2_5 */
#define CT1_MAT1_P2_5 A15X_MUX('2',5,5) /* PT2_5 */
#define SmartDMA_PIO29_P2_5 A15X_MUX('2',5,7) /* PT2_5 */
#define OPAMP2_OUT_P2_6 A15X_MUX('2',6,0) /* PT2_6 */
#define ADC2_A2_P2_6 A15X_MUX('2',6,0) /* PT2_6 */
#define P2_6 A15X_MUX('2',6,0) /* PT2_6 */
#define ADC1_A3_P2_6 A15X_MUX('2',6,0) /* PT2_6 */
#define TRIG_OUT4_P2_6 A15X_MUX('2',6,1) /* PT2_6 */
#define LPSPI1_PCS1_P2_6 A15X_MUX('2',6,2) /* PT2_6 */
#define LPUART4_RXD_P2_6 A15X_MUX('2',6,3) /* PT2_6 */
#define CT_INP18_P2_6 A15X_MUX('2',6,4) /* PT2_6 */
#define CT1_MAT2_P2_6 A15X_MUX('2',6,5) /* PT2_6 */
#define SmartDMA_PIO30_P2_6 A15X_MUX('2',6,7) /* PT2_6 */
#define ADC0_A7_P2_7 A15X_MUX('2',7,0) /* PT2_7 */
#define VREFI_P2_7 A15X_MUX('2',7,0) /* PT2_7 */
#define ADC2_A7_P2_7 A15X_MUX('2',7,0) /* PT2_7 */
#define ADC1_A7_P2_7 A15X_MUX('2',7,0) /* PT2_7 */
#define ADC3_A7_P2_7 A15X_MUX('2',7,0) /* PT2_7 */
#define P2_7 A15X_MUX('2',7,0) /* PT2_7 */
#define TRIG_IN5_P2_7 A15X_MUX('2',7,1) /* PT2_7 */
#define LPUART4_TXD_P2_7 A15X_MUX('2',7,3) /* PT2_7 */
#define CT_INP19_P2_7 A15X_MUX('2',7,4) /* PT2_7 */
#define TRIG_IN5/CT_INP19_P2_7_P2_7 A15X_MUX('2',7,4) /* PT2_7 */
#define CT1_MAT3_P2_7 A15X_MUX('2',7,5) /* PT2_7 */
#define SmartDMA_PIO31_P2_7 A15X_MUX('2',7,7) /* PT2_7 */
#define P2_8 A15X_MUX('2',8,0) /* PT2_8 */
#define TRIG_OUT3_P2_8 A15X_MUX('2',8,1) /* PT2_8 */
#define CT3_MAT0_P2_8 A15X_MUX('2',8,4) /* PT2_8 */
#define P2_9 A15X_MUX('2',9,0) /* PT2_9 */
#define TRIG_IN4_P2_9 A15X_MUX('2',9,1) /* PT2_9 */
#define CT3_MAT1_P2_9 A15X_MUX('2',9,4) /* PT2_9 */
#define P2_10 A15X_MUX('2',10,0) /* PT2_10 */
#define ADC2_A1_P2_10 A15X_MUX('2',10,0) /* PT2_10 */
#define TRIG_OUT5_P2_10 A15X_MUX('2',10,1) /* PT2_10 */
#define LPUART2_TXD_P2_10 A15X_MUX('2',10,3) /* PT2_10 */
#define CT3_MAT2_P2_10 A15X_MUX('2',10,4) /* PT2_10 */
#define SmartDMA_PIO14_P2_10 A15X_MUX('2',10,7) /* PT2_10 */
#define ADC3_A1_P2_11 A15X_MUX('2',11,0) /* PT2_11 */
#define P2_11 A15X_MUX('2',11,0) /* PT2_11 */
#define TRIG_IN4_P2_11 A15X_MUX('2',11,1) /* PT2_11 */
#define LPUART2_RXD_P2_11 A15X_MUX('2',11,3) /* PT2_11 */
#define CT3_MAT3_P2_11 A15X_MUX('2',11,4) /* PT2_11 */
#define SmartDMA_PIO15_P2_11 A15X_MUX('2',11,7) /* PT2_11 */
#define P2_12 A15X_MUX('2',12,0) /* PT2_12 */
#define ADC2_A5_P2_12 A15X_MUX('2',12,0) /* PT2_12 */
#define WUU0_IN20_P2_12 A15X_MUX('2',12,0) /* PT2_12 */
#define OPAMP0_INP_P2_12 A15X_MUX('2',12,0) /* PT2_12 */
#define ADC0_A5_P2_12 A15X_MUX('2',12,0) /* PT2_12 */
#define LPSPI1_SCK_P2_12 A15X_MUX('2',12,2) /* PT2_12 */
#define LPUART1_RXD_P2_12 A15X_MUX('2',12,3) /* PT2_12 */
#define CT4_MAT0_P2_12 A15X_MUX('2',12,4) /* PT2_12 */
#define CT0_MAT0_P2_12 A15X_MUX('2',12,5) /* PT2_12 */
#define SmartDMA_PIO16_P2_12 A15X_MUX('2',12,7) /* PT2_12 */
#define CAN0_RXD_P2_12 A15X_MUX('2',12,11) /* PT2_12 */
#define P2_13 A15X_MUX('2',13,0) /* PT2_13 */
#define OPAMP0_INN_P2_13 A15X_MUX('2',13,0) /* PT2_13 */
#define ADC1_A5_P2_13 A15X_MUX('2',13,0) /* PT2_13 */
#define ADC3_A5_P2_13 A15X_MUX('2',13,0) /* PT2_13 */
#define TRIG_IN8_P2_13 A15X_MUX('2',13,1) /* PT2_13 */
#define LPSPI1_SDO_P2_13 A15X_MUX('2',13,2) /* PT2_13 */
#define LPUART1_TXD_P2_13 A15X_MUX('2',13,3) /* PT2_13 */
#define CT4_MAT1_P2_13 A15X_MUX('2',13,4) /* PT2_13 */
#define CT0_MAT1_P2_13 A15X_MUX('2',13,5) /* PT2_13 */
#define SmartDMA_PIO17_P2_13 A15X_MUX('2',13,7) /* PT2_13 */
#define CAN0_TXD_P2_13 A15X_MUX('2',13,11) /* PT2_13 */
#define P2_14 A15X_MUX('2',14,0) /* PT2_14 */
#define CT4_MAT2_P2_14 A15X_MUX('2',14,4) /* PT2_14 */
#define OPAMP0_OUT_P2_15 A15X_MUX('2',15,0) /* PT2_15 */
#define ADC0_A2_P2_15 A15X_MUX('2',15,0) /* PT2_15 */
#define P2_15 A15X_MUX('2',15,0) /* PT2_15 */
#define WUU0_IN21_P2_15 A15X_MUX('2',15,0) /* PT2_15 */
#define TRIG_OUT4_P2_15 A15X_MUX('2',15,1) /* PT2_15 */
#define LPSPI1_SDI_P2_15 A15X_MUX('2',15,2) /* PT2_15 */
